[
    {
        "companyName": "Samsung Research America",
        "dateStart": "May 2019",
        "dateEnd": "Aug 2019",
        "location": "Montain View, CA",
        "title": "Software Engineer Intern",
        "details": [
            "Designed dynamic Electronic Program Guide on Smart TV to improve the user experience by using React",
            "Managed states in ReactJs by using Redux to simplify programming logic"
        ],
        "bgClassName": "acsBG"
    },
    {
        "companyName": "Alliance Computer Systems Ltd. Taiwan Branch",
        "dateStart": "Aug 2017",
        "dateEnd": "Oct 2017",
        "location": "Taipei, Taiwan",
        "title": "Frontend Web Engineer",
        "details": [
            "Designed and created reusable components to be utilized on different web-based slot games",
            "Improved maintainability of gambling control system in React using Redux",
            "Built Responsive web pages with React, SCSS, and HTML5"
        ],
        "bgClassName": "acsBG"
    },
    {
        "companyName": "Green Bamboo Technology",
        "dateStart": "Mar 2015",
        "dateEnd": "Feb 2017",
        "location": "Taipei, Taiwan",
        "title": "Full Stack Engineer",
        "details": [
            "Designed and constructed frontend system of horse racing game with Responsive Web Design",
            "Developed back-end system based on Java and Spring framework for real-time horse racing ticket transaction system supports 5,000 concurrent users",
            "Devised an automatic web scraper to gather and generate data to replace manual data entering and supported real-time odds updating",
            "Reduced response time by 90% in calculating dynamic horse racing odds by creating MySQL Stored Procedures to reduce database transaction volume",
            "Communicated with clients and solved real-time issues reported by clients during horse racing games",
            "Led a team in building a phone app regarding shopping system for iOS through Xamarin"
        ],
        "bgClassName": "gbBG"        
    },
    {
        "companyName": "PerfectPairs Entertainment Inc.",
        "dateStart": "Sep 2014",
        "dateEnd": "Nov 2014",
        "location": "Taipei, Taiwan",
        "title": "Software Engineer",
        "details": [
            "Constructed an online gaming platform using C# for third-party games",
            "Developed a user authentication function"
        ],
        "bgClassName": "ppBG"
    },
    {
        "companyName": "Chang Gung University",
        "dateStart": "Spring 2011",
        "dateEnd": "Fall 2011",
        "location": "Taoyuan, Taiwan",
        "title": "Teaching Assistant",
        "details": [
            "As I wanted to share my ideas and findings with others, I became a teaching assistant in both Digital Circuit Experiment and Computer Organization Experiment. In Digital Circuit Experiment, I taught the basics of logic gates and how to implement advanced logic circuits on breadboards. In Computer Organization Experiment, I taught students how to implement a fundamental CPU by using Verilog on an FPGA board. My teaching experience also gave me the opportunity to cultivate my knowledge and presentational skills."
        ],
        "bgClassName": "taBG"
    },
    {
        "companyName": "UserJoy Entertainment Inc.",
        "dateStart": "Jul 2009",
        "dateEnd": "Aug 2009",
        "location": "Taipei, Taiwan",
        "title": "Intern",
        "details": [
            "Based on my experience leading a 3D game project, I helped game programmers discover memory leak issues when loading new 3D views. It was here that I gained first-hand experience in developing product-level systems in a collaborative environment."
        ],
        "bgClassName": "ujBG"
    }
]